## 資料庫操作

In [2]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION();')
data = cur.fetchone()
print(data)
con.close()

('3.14.2',)

In [4]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION();')
    data = cur.fetchone()
    print(data)

('3.14.2',)

In [5]:
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    # 如果表格存在，捨棄表格
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    # 建立PhoneAddress 表格
    cur.execute("CREATE TABLE PhoneAddress(\
                      phone   CHAR(10) PRIMARY KEY, \
                      address TEXT                , \
                      name    TEXT unique         , \
                      age     INT NOT NULL)") 
    # 新增資料
    cur.execute("INSERT INTO PhoneAddress VALUES(\
                  '0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES(\
                  '0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES(\
                  '0957209108','Taipei','Richard',29)")
    #查詢資料
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchall() 
    for rec in data: 
        print(rec)
        #print(rec[0], rec[1])

('0912173381', 'United State')
('0928375018', 'Tokyo Japan')
('0957209108', 'Taipei')

In [9]:
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    #查詢資料
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchone()
    print(data)
    data = cur.fetchall()
    print(data)
    #for rec in data: 
    #    print(rec)
        #print(rec[0], rec[1])

('0912173381', 'United State')
[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

## 使用Pandas 操作SQLite

In [10]:
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},\
            {'name':'John', 'age':33 , 'gender': 'M'}]

df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [11]:
import sqlite3 as lite
with lite.connect('test.sqlite') as db:
    df.to_sql(name='employee', index=False, con=db, if_exists='replace')

In [35]:
import pandas
dfs = pandas.read_html('http://rate.bot.com.tw/xrt/quote/l6m/USD')
df = dfs[0]
df = df[[0,1,2,3,4,5]]
df.columns = ['掛牌日期', '幣別', '現金匯率-買入','現金匯率-賣出', '即期匯率-買入', '即期匯率-賣出']

with lite.connect('test.sqlite') as db:
    df.to_sql(name='USD', index=False, con=db, if_exists='replace')

## 安裝 MySQLdb
- pip install PyMySQL

In [15]:
! pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-0.7.11-py2.py3-none-any.whl (78kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-0.7.11

In [33]:
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},\
            {'name':'John', 'age':33 , 'gender': 'M'}]

df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [37]:

import pymysql

from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root:"+'test'+"@localhost/appledaily?charset=utf8", encoding = 'UTF-8')
df.to_sql(name='currency', con=engine, if_exists='replace')
#df.to_sql(name, con=engine, if_exists='fail', index=True, index_label=None)
db.close()

C:\ProgramData\Anaconda3\lib\site-packages\pymysql\cursors.py:166: Warning: (1366, "Incorrect string value: '\\xA5x\\xA5_\\xBC\\xD0...' for column 'VARIABLE_VALUE' at row 480")
  result = self._query(query)

In [ ]:
db = pymysql.connect(host="localhost",
                     user="root",
                     passwd="test",
                     db="appledaily",
                     charset='utf8')

In [52]:
import requests
rs = requests.session()
payload1 = {
'CinemaId':'1',
'SessionTime':'8/20/2017 6:15:00 PM',
'OrderTickets[0][CinemaId]':'1',
'OrderTickets[0][SessionId]':'1166958',
'OrderTickets[0][HoCode]':'HO00000001',
'OrderTickets[0][PriceCode]':'0001',
'OrderTickets[0][Qty]':'2',
'SessionId':'1166958',    
}
payload = {
'cinemacode':'1',
'txtSessionId':'1166958',
'Orders[OrderTickets][0][CinemaId]':'1',
'Orders[OrderTickets][0][SessionId]':'1166958',
'Orders[OrderTickets][0][HoCode]':'HO00000001',
'Orders[OrderTickets][0][PriceCode]':'0001',
'Orders[OrderTickets][0][Qty]':'2',
'SessionTime':'8/20/2017 6:15:00 PM',
'MovieName':'(數位)東京喰種 ',  
}
headers = {
'Referer':'https://sales.vscinemas.com.tw/VieShowTicket/?cinemacode=1&txtSessionId=1166958',
'User-Agent':'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/60.0.3112.90 Safari/537.36',
'Cookie':'ASP.NET_SessionId=3bnpc5ejpkoq4sdysww5jfgl; _ga=GA1.3.366970417.1502011895; _gid=GA1.3.338287781.1503197651'
}
res0 = rs.post('https://sales.vscinemas.com.tw/VieShowTicket/Home/OrderTickets', data = payload1, headers = headers)
res1 = rs.post('https://sales.vscinemas.com.tw/VieShowTicket/Home/OrderTickets', data = payload, headers = headers)
res2 = rs.post('https://sales.vscinemas.com.tw/VieShowTicket/Home/SelectSeats', data = {}, headers = headers)
dfs = pandas.read_html(res2.text)

In [55]:
dfs[2]

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
2,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
3,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
4,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
5,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
6,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0
7,NaN,NaN,1.0,2.0,3.0,4.0,NaN,5.0,6.0,7.0,8.0,9.0,10.0,11.0,12.0,NaN,13.0,14.0,15.0,16.0